Семейный_бюджет/src/Documents/РасходДенегФактический/РасходДенегФактический.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходДенегФактический</name>
  <basedOn>Document.РасходДенегПлановый</basedOn>
  <registerRecords>AccumulationRegister.ОбязательныеРасходыПланФакт</registerRecords>
  <registerRecords>AccumulationRegister.ДвижениеДенегФакт</registerRecords>
  <registerRecords>AccumulationRegister.ВсеРасходыПланФакт</registerRecords>
  <attributes>
    <name>Период</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Адресат</name>
    <type>
      <types>CatalogRef.АдресатыПокупок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемаПокупки</name>
    <type>
      <types>CatalogRef.ТемыПокупок</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяАналитика</name>
    <type>
      <types>CatalogRef.ДополнительныеАналитики</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательныйЕжемесячныйРасход</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаБудущийМесяц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

Семейный_бюджет/src/AccumulationRegisters/ДвижениеДенегФакт/ДвижениеДенегФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвижениеДенегФакт</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>CatalogRef.ИсточникиДенег</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Адресат</name>
    <type>
      <types>CatalogRef.АдресатыПокупок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТемаПокупки</name>
    <type>
      <types>CatalogRef.ТемыПокупок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительнаяАналитика</name>
    <type>
      <types>CatalogRef.ДополнительныеАналитики</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Семейный_бюджет/src/AccumulationRegisters/ОбязательныеРасходыПланФакт/ОбязательныеРасходыПланФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОбязательныеРасходыПланФакт</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПериодБюждета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>CatalogRef.ИсточникиДенег</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Адресат</name>
    <type>
      <types>CatalogRef.АдресатыПокупок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТемаПокупки</name>
    <type>
      <types>CatalogRef.ТемыПокупок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительнаяАналитика</name>
    <type>
      <types>CatalogRef.ДополнительныеАналитики</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Семейный_бюджет/src/AccumulationRegisters/ВсеРасходыПланФакт/ВсеРасходыПланФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВсеРасходыПланФакт</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПериодБюждета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>CatalogRef.ИсточникиДенег</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Адресат</name>
    <type>
      <types>CatalogRef.АдресатыПокупок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТемаПокупки</name>
    <type>
      <types>CatalogRef.ТемыПокупок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительнаяАналитика</name>
    <type>
      <types>CatalogRef.ДополнительныеАналитики</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Семейный_бюджет/src/Documents/РасходДенегФактический/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	//TODO поправь уже!
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходДенегПлановый") Тогда
		// Заполнение шапки
		Дата = ДанныеЗаполнения.Дата;
		Период = ДанныеЗаполнения.Период;
		Адресат = ДанныеЗаполнения.Адресат;
		ДополнительнаяАналитика = ДанныеЗаполнения.ДополнительнаяАналитика;
		Сумма = ДанныеЗаполнения.Сумма;
		ТемаПокупки = ДанныеЗаполнения.ТемаПокупки;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//FIXME поправь уже2!
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
      ДвиженияПоРегистрам(Отказ, Режим)


	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ДвиженияПоРегистрам(Отказ, Режим)
	
		// регистр ДвижениеДенегФакт Расход
	Движения.ДвижениеДенегФакт.Записывать = Истина;
	Движение = Движения.ДвижениеДенегФакт.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Адресат = Адресат;
	Движение.ТемаПокупки = ТемаПокупки;
	Движение.ДополнительнаяАналитика = ДополнительнаяАналитика;
	Движение.Сумма = Сумма;

       // регистр ОбязательныеРасходыПланФакт Приход

	Если ОбязательныйЕжемесячныйРасход тогда
		Движения.ОбязательныеРасходыПланФакт.Записывать = Истина;
		Движение = Движения.ОбязательныеРасходыПланФакт.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = КонецДня(Дата);
		Движение.ПериодБюждета = Период;
		Движение.Адресат = Адресат;
		Движение.ТемаПокупки = ТемаПокупки;
		Движение.ДополнительнаяАналитика = ДополнительнаяАналитика;
		Движение.Сумма = Сумма;

	КонецЕсли;
	
	
	       // регистр всеРасходыПланФакт Приход

		Движения.ВсеРасходыПланФакт.Записывать = Истина;
		Движение = Движения.ВсеРасходыПланФакт.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = КонецДня(Дата);
		Движение.ПериодБюждета = Период;
		Движение.Адресат = Адресат;
		Движение.ТемаПокупки = ТемаПокупки;
		Движение.ДополнительнаяАналитика = ДополнительнаяАналитика;
		Движение.Сумма = Сумма;


КонецПроцедуры
